* Question
In the multiple dwelling problem, how many sets of assignments are there of people to floors, both before and after the requirement that floor assignments be distinct? It is very inefficient to generate all possible assignments of people to floors and then leave it to backtracking to eliminate them. For example, most of the restrictions depend on only one or two of the person-floor variables, and can thus be imposed before floors have been selected for all the people. Write and demonstrate a much more efficient non-deterministic procedure that solves this problem based upon generating only those possibilities that are not already ruled out by previous restrictions. (Hint: This will require a nest of ~let~ expressions.)

* Answer
We gain efficiency by interleaving requirements with person-floor generation. This provides a dramatic optimization beyond what was accomplished in Ex 4.39.

#+begin_src scheme :results output :exports both
  ;; Load
  (load "4.ambeval.scm")

  ;; Answer
  (define orig
    '(let ((baker (amb 1 2 3 4 5))
           (cooper (amb 1 2 3 4 5))
           (fletcher (amb 1 2 3 4 5))
           (miller (amb 1 2 3 4 5))
           (smith (amb 1 2 3 4 5)))
       (require (distinct? (list baker cooper fletcher miller smith)))
       (require (not (= baker 5)))
       (require (not (= cooper 1)))
       (require (not (= fletcher 5)))
       (require (not (= fletcher 1)))
       (require (> miller cooper))
       (require (not (= (abs (- smith fletcher)) 1)))
       (require (not (= (abs (- fletcher cooper)) 1)))
       (list (list 'baker baker)
             (list 'cooper cooper)
             (list 'fletcher fletcher)
             (list 'miller miller)
             (list 'smith smith))))

  (define fast
    '(let ((baker (amb 1 2 3 4 5)))
       (require (not (= baker 5)))
       (let ((cooper (amb 1 2 3 4 5)))
         (require (not (= cooper 1)))
         (let ((fletcher (amb 1 2 3 4 5)))
           (require (not (= fletcher 5)))
           (require (not (= fletcher 1)))
           (require (not (= (abs (- fletcher cooper)) 1)))
           (let ((miller (amb 1 2 3 4 5)))
             (require (> miller cooper))
             (let ((smith (amb 1 2 3 4 5)))
               (require (not (= (abs (- smith fletcher)) 1)))
               (require (distinct? (list baker cooper fletcher miller smith)))
               (list (list 'baker baker)
                     (list 'cooper cooper)
                     (list 'fletcher fletcher)
                     (list 'miller miller)
                     (list 'smith smith))))))))

  ;; Test
  (map (lambda (obj)
         (display (car obj))
         (display " ")
         (display (elapsed (cdr obj)))
         (newline))
       (list (cons 'orig (lambda () (mc-eval orig)))
             (cons 'fast (lambda () (mc-eval fast)))))
#+end_src

#+RESULTS:
: orig 2.28
: fast .28
